{
  "id": "blog_1763324029715_cl4ird0wf",
  "type": "pull_request",
  "title": "[컴퓨터공학부_류명현] 2주차 LLM 연동하기",
  "content": "# PR #47: [컴퓨터공학부_류명현] 2주차 LLM 연동하기\n\n## 개요\n이번 PR은 2주차 과제로 LLM(대형 언어 모델)을 기존 블로그 시스템에 연동하는 작업을 진행했습니다. 블로그 글 생성 기능을 추가하고, 이를 파일 시스템에 저장하는 방식을 구현하였습니다.\n\n## 문제 정의\n이전 단계에서는 블로그 글을 작성하기 위한 기초적인 구조만 마련되어 있었고, 사용자가 커밋 메시지를 기반으로 블로그 글을 작성할 수 있는 기능이 필요했습니다. 또한, 생성된 블로그 글을 어디에 저장할지에 대한 고민도 있었습니다. DB를 사용하는 방법도 있었지만, 초기 구현에서는 더 빠르게 결과를 확인할 수 있는 방법이 필요했습니다.\n\n## 해결 방법\n서버와의 통신 방식을 고민한 끝에, GitHub API를 직접 호출하는 대신 클라이언트에서 LLM에 요청을 보내는 구조를 선택했습니다. 이를 통해 서버를 거치지 않고도 클라이언트에서 직접 필요한 정보를 얻을 수 있게 되었습니다. 물론, 정석적인 방법은 서버의 DB에 저장하는 것이지만, 우선적으로 작동 가능한 서비스를 구현하는 것이 더 중요하다고 판단했습니다. 따라서, 생성된 블로그 글을 파일 시스템에 JSON 형태로 저장하는 방식을 선택했습니다.\n\n## 구현 세부사항\n- **LLM 연결**: `openaiService.js` 파일에서 OpenAI와 통신하는 함수를 구현했습니다. 이곳에는 모든 시스템 프롬프트가 포함되어 있어, 코드가 다소 복잡해질 수 있습니다. 향후 이를 리팩토링하여 더 깔끔하게 관리할 필요가 있습니다.\n  \n- **블로그 내용 구성**: 블로그 글에 포함할 항목으로는 커밋 메시지, 변경된 파일 목록, diff 내용, PR 설명 및 코멘트를 정했습니다. 이러한 정보들은 블로그 글의 유용성을 높이는 데 기여할 것입니다.\n\n- **프론트엔드 작업**: 클라이언트 측에서는 블로그 글 생성을 위한 API를 추가하고, 커밋 항목을 클릭했을 때 블로그를 생성하는 기능을 구현했습니다. `CommitItem` 컴포넌트에서 블로그 생성 요청을 처리하고, 결과를 보여주는 `BlogViewer` 컴포넌트를 연결했습니다.\n\n- **파일 시스템 저장**: 생성된 블로그 글을 JSON 파일로 저장하기 위해 서버 측에 블로그 관련 라우트를 추가했습니다. 이때 데이터베이스를 사용하지 않고 간단한 파일 시스템을 활용하여 결과를 빠르게 확인할 수 있도록 했습니다.\n\n## 결과\n이번 PR을 통해 클라이언트와 LLM 간의 통신이 원활하게 이루어졌으며, 사용자가 커밋 메시지를 기반으로 블로그 글을 생성할 수 있는 기능이 추가되었습니다. 또한, 블로그 글은 JSON 형태로 파일에 저장되어 쉽게 접근할 수 있게 되었습니다. \n\n결과적으로, 사용자가 GitHub의 커밋 히스토리를 보다 쉽게 활용할 수 있는 블로그 시스템이 한층 더 완성되었습니다. 앞으로는 이 구조를 기반으로 리팩토링 및 추가적인 기능 개선을 진행할 예정입니다.\n\n## 마무리\n이번 PR을 통해 LLM과의 연동 작업을 성공적으로 마무리하였습니다. 다음 단계에서는 코드의 리팩토링과 함께 사용자 경험을 개선하기 위한 다양한 기능을 추가해 나가고자 합니다. 변화하는 기술 환경에 발맞추어 계속해서 발전하는 블로그 시스템이 되길 바랍니다!",
  "repoName": "boostcampwm-snu-2025/aiblog",
  "sourceData": {
    "owner": "boostcampwm-snu-2025",
    "repo": "aiblog",
    "number": 47,
    "user": {
      "login": "paul2126",
      "avatar_url": "https://avatars.githubusercontent.com/u/29268973?v=4"
    },
    "state": "open",
    "created_at": "2025-11-16T20:11:18Z",
    "merged_at": null,
    "html_url": "https://github.com/boostcampwm-snu-2025/aiblog/pull/47"
  },
  "createdAt": "2025-11-16T20:13:49.715Z"
}